1.请按以下要求顺序编码：
 定义一个：键Integer，值String类型的HashMap集合
 存储以下数据：
	1，"张三"
	2，"李四"
	1，"王五"
 (1)打印集合大小；
 (2)使用“键找值”的方式遍历集合，打印键和值；
 (3)使用“键值对”的方式遍历集合，打印键和值；
 (4)获取键为1的值，并打印
 (5)获取键为10的值，并打印
 (6)判断集合中是否有键：10
 (7)删除键为1的键值对，删除完毕打印集合
2.有以下字符串：
	String str = "fje你kw我FDQFj你feAF他Eajf他eo2FA我FEjfew";
	请编程统计每个字符出现的次数
3.ArrayList有以下元素: "a","f","b","c","a","d"，请用任意方式完成集合元素去重。去除集合中重复的元素。	
4.双色球规则，双色球每注投注号码由6个1—33的号码和1个1—16的号码组成。其中6个1-33的数字要求不能重复。请随机生成一注双色球号码
5 题目
	请编写main()方法，按以下要求顺序,定义一个Set集合，并存储以下数据：
	刘备，关羽，张飞，刘备，张飞
	打印集合大小
	使用迭代器遍历集合，并打印每个元素
	使用增强for遍历集合，并打印每个元素
6 题目
	请按以下要求顺序编码：
	定义学生类Student，属性：姓名、性别、年龄
	定义测试类，及main()方法
	定义一个存储Student类型的HashSet集合
	创建以下三个Student对象
		张三,男,20
		李四,女,21
		张三,男,20
	将上述三个对象存储到Set集合中
	使用增强for遍历集合，获取每个Student对象，并打印属性值；
	请实现集合中不能存储姓名年龄相同的元素
7 题目
	请按以下要求顺序编码：
	定义一个可以存储“整数”的LinkedHashSet对象
	存储以下整数
		20,30,50,10,30,20
	打印集合大小。为什么跟存入的数量不一致？
	使用增强for遍历集合，打印大于25的元素
8.随机10个不重复的1-100的整数存入集合, 分别使用ArrayList和HashSet集合实现.观察以下问题, 思考Set集合是否可以完成?
  将元素的奇数放左边 ,偶数放右边.最后总结Set对比List集合的缺点在何处?
  
